### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

C:\Users\skme2\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\skme2\anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\skme2\anaconda3\lib\site-packages\numpy\.libs\libopenblas.FB5AE2TYXYH2IJRDKGDGQ3XBKLKTF43H.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [4]:
my_list = list('abcdefghijklmnopqrstuvwxyz')

In [6]:
myy_arr = np.arange(26)

In [7]:
my_list

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z']

In [8]:
myy_arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [13]:
my_dict = dict(zip(my_list, myy_arr))

In [14]:
my_dict

{'a': 0,
 'b': 1,
 'c': 2,
 'd': 3,
 'e': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [24]:
pd.DataFrame.from_dict(my_dict, orient='index')

    0
a   0
b   1
c   2
d   3
e   4
f   5
g   6
h   7
i   8
j   9
k  10
l  11
m  12
n  13
o  14
p  15
q  16
r  17
s  18
t  19
u  20
v  21
w  22
x  23
y  24
z  25

In [29]:
pd.DataFrame(my_dict, index=[1])

   a  b  c  d  e  f  g  h  i  j  ...   q   r   s   t   u   v   w   x   y   z
1  0  1  2  3  4  5  6  7  8  9  ...  16  17  18  19  20  21  22  23  24  25

[1 rows x 26 columns]

In [31]:
pd.Series(my_dict).to_frame()

    0
a   0
b   1
c   2
d   3
e   4
f   5
g   6
h   7
i   8
j   9
k  10
l  11
m  12
n  13
o  14
p  15
q  16
r  17
s  18
t  19
u  20
v  21
w  22
x  23
y  24
z  25

In [32]:
my_dict

{'a': 0,
 'b': 1,
 'c': 2,
 'd': 3,
 'e': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [34]:
pd.Series(my_dict).to_frame()

    0
a   0
b   1
c   2
d   3
e   4
f   5
g   6
h   7
i   8
j   9
k  10
l  11
m  12
n  13
o  14
p  15
q  16
r  17
s  18
t  19
u  20
v  21
w  22
x  23
y  24
z  25

In [36]:
pd.DataFrame(my_dict,index=[1])

   a  b  c  d  e  f  g  h  i  j  ...   q   r   s   t   u   v   w   x   y   z
1  0  1  2  3  4  5  6  7  8  9  ...  16  17  18  19  20  21  22  23  24  25

[1 rows x 26 columns]

In [39]:
pd.DataFrame.from_dict(my_dict, orient='index').reset_index()

   index   0
0      a   0
1      b   1
2      c   2
3      d   3
4      e   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

In [17]:
pd.DataFrame({'name':['prateek','navneet'],
'CGPA':[50,60]})

      name  CGPA
0  prateek    50
1  navneet    60

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [46]:
series = pd.Series(np.take(list('abcdefgh'), np.random.randint(8,size = 50)))

In [47]:
series

0     h
1     g
2     e
3     a
4     a
5     g
6     d
7     h
8     a
9     a
10    e
11    e
12    a
13    h
14    b
15    d
16    a
17    c
18    a
19    g
20    b
21    c
22    b
23    c
24    e
25    g
26    h
27    e
28    d
29    d
30    a
31    e
32    e
33    c
34    f
35    g
36    g
37    f
38    h
39    h
40    b
41    c
42    a
43    d
44    c
45    d
46    c
47    f
48    a
49    e
dtype: object

In [48]:
series.value_counts()

a    10
e     8
c     7
h     6
g     6
d     6
b     4
f     3
dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

In [53]:
df = pd.read_csv(r"C:\Users\skme2\Downloads\iris12.csv", usecols=[1,3,4])

In [54]:
df

     sepal_width  petal_width    species
0            3.5          0.2     setosa
1            3.0          0.2     setosa
2            3.2          0.2     setosa
3            3.1          0.2     setosa
4            3.6          0.2     setosa
..           ...          ...        ...
145          3.0          2.3  virginica
146          2.5          1.9  virginica
147          3.0          2.0  virginica
148          3.4          2.3  virginica
149          3.0          1.8  virginica

[150 rows x 3 columns]

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [55]:
df = pd.read_csv(r"C:\Users\skme2\Downloads\iris12.csv", usecols=['sepal_width'])

In [56]:
df

     sepal_width
0            3.5
1            3.0
2            3.2
3            3.1
4            3.6
..           ...
145          3.0
146          2.5
147          3.0
148          3.4
149          3.0

[150 rows x 1 columns]

In [110]:
# read fruits.csv file
df = pd.read_csv('fruits.csv')

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [64]:
group_object = df.groupby('Fruit Name')['Price']

In [69]:
group_object.aggregate(['mean', 'min', 'max', 'median']).reset_index()

   Fruit Name        mean  min  max  median
0      Banana   98.500000   85  112    98.5
1       Mango  106.666667   60  160   100.0
2   PineApple  187.500000   90  285   187.5
3  Strawberry  200.000000  200  200   200.0

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

In [70]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [72]:
df.Price.sum()

1092

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [73]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [78]:
df['p/q'] = np.round(df.Price/df.Quantity,1)

In [79]:
df.Quantity

0     78
1     40
2     20
3     15
4    100
5     25
6     40
7     50
Name: Quantity, dtype: int64

In [84]:
df.sort_values(by='p/q', ascending=False).iloc[0]['Fruit Name']

'PineApple'

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

In [85]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]

In [87]:
pd.get_dummies(arr, drop_first=True)

    1  2  3  4  5  6
0   0  0  0  0  0  0
1   1  0  0  0  0  0
2   0  0  0  0  0  0
3   1  0  0  0  0  0
4   0  0  0  0  0  0
5   0  1  0  0  0  0
6   0  0  1  0  0  0
7   0  0  0  0  0  1
8   0  0  0  0  1  0
9   0  0  0  0  0  0
10  0  0  0  0  0  0
11  0  0  0  0  0  0
12  0  0  0  1  0  0
13  1  0  0  0  0  0
14  0  1  0  0  0  0
15  0  0  1  0  0  0
16  0  0  0  0  1  0
17  0  0  0  0  1  0
18  0  0  0  1  0  0
19  0  0  0  1  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [101]:
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [102]:
df = pd.DataFrame(dict_)

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [94]:
df.isnull().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [97]:
df['First Score'].mean()

95.0

In [105]:
df['First Score'].dropna().mean()

95.0

In [98]:
df['First Score'].fillna(value=df['First Score'].mean(), inplace=True)

In [99]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [106]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [108]:
for col in df:
    df[col].fillna(value=df[col].dropna().mean(), inplace=True)

In [109]:
df

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [112]:
df.reset_index()

   index  Fruit Name  Quantity  Price
0      0      Banana        78    112
1      1       Mango        40    160
2      2      Banana        20     85
3      3   PineApple        15     90
4      4  Strawberry       100    200
5      5       Mango        25     60
6      6       Mango        40    100
7      7   PineApple        50    285

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [115]:
df = pd.read_csv('sample_sheet_1.csv')

In [116]:
ddf1 = pd.read_csv('sample_sheet_2.csv')

In [118]:
pd.merge(df,ddf1, on='Location', how = 'left')

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday